export const mbtiTypes = [
  ['E', 'Extraversion', 'I', 'Introversion'],
  ['S', 'Social', 'N', 'Nonsocial'],
  ['O', 'Outside', 'H', 'Home'],
  ['W', 'Wet', 'D', 'Dry'],
];

export const mbti = [
  'ESOW',
  'ESOD',
  'ESHW',
  'ESHD',
  'ENOW',
  'ENOD',
  'ENHW',
  'ENHD',
  'ISOW',
  'ISOD',
  'ISHW',
  'ISHD',
  'INOW',
  'INOD',
  'INHW',
  'INHD',
];

export const mbtiContent: { [key: string]: String[] } = {
  ESOW: ['활발하고 친구들과 노는 것을 좋아하는 댕댕이🐾', '다비켜!', '산책과 물 또한 내 것이지.'],
  ESOD: ['활발하고 친구들과 노는 것을 좋아하는 댕댕이🐾','다비켜! 산책 간다.', '씻지는 않을 겁니다.'],
  ESHW: ['활발하고 친구들과 노는 것을 좋아하는 댕댕이🐾','그렇지만 집이 젤 좋은 집멍이🏠', '물놀이도 집에서 할 거죠??'],
  ESHD: ['활발하고 친구들과 노는 것을 좋아하는 댕댕이🐾', '그렇지만 집이 젤 좋은 집멍이🏠', '집에만 있으니까 안 씻어도 되죠??'],
  ENOW: ['활발하지만 소심한 우리집 댕댕이🐾', '작고 소듕해.. ', '산책갔다 물놀이 할래?'],
  ENOD: ['활발하지만 소심한 우리집 댕댕이🐾', ' 작고 소듕해..', '산책은 가도 씻지는 않는 꼬질이..'],
  ENHW: ['활발하지만 소심한 우리집 댕댕이🐾', '작고 소듕해..', '집에서 물놀이 할까??'],
  ENHD: ['활발하지만 소심한 우리집 댕댕이🐾', '집이 젤 좋은 집멍이🏠', '집에만 있으니까 안 씻어도 되죠??'],
  ISOW: ['조용하지만 친구들과 노는 것을 좋아하는 댕댕이🐾', '쭈글해..', '산책갔다 물놀이 할래?'],
  ISOD: ['조용하지만 친구들과 노는 것을 좋아하는 댕댕이🐾', '쭈글해..', '산책은 가고싶지만 씻기는 싫어.'],
  ISHW: ['조용하지만 친구들과 노는 것을 좋아하는 댕댕이🐾', '집이 젤 좋은 집멍이🏠', '물놀이도 집에서 할 거죠??'],
  ISHD: ['조용하지만 친구들과 노는 것을 좋아하는 댕댕이🐾', '집이 젤 좋은 집멍이🏠','집에만 있으니까 안 씻어도 되죠??'],
  INOW: ['조용한데 소심하기까지 한 우리집 댕댕이🐾', '작고 소듕해..', '산책갔다 물놀이 할래?'],
  INOD: ['조용한데 소심하기까지 한 우리집 댕댕이🐾', '작고 소듕해..', '산책은 가도 씻지는 않는 꼬질이..'],
  INHW: ['조용한데 소심하기까지 한 우리집 댕댕이🐾', '작고 소듕해..', '집에서 물놀이 할까??'],
  INHD: ['조용한데 소심하기까지 한 우리집 댕댕이🐾', '집이 젤 좋은 집멍이🏠', '집에만 있으니까 안 씻어도 되죠??'],
};
